# AnalyticalVolume Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
EnergyAnalysisSpace..::..AnalyticalVolume Property
EnergyAnalysisSpace Class See Also
---
The volume for this space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double AnalyticalVolume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AnalyticalVolume As Double
	Get
```

Visual C++
---
```text
public:
property double AnalyticalVolume {
	double get ();
}
```

# Remarks
The analytical space volume is bounded by the center plane of walls and the top plane of roofs and floors.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace